var tw_si = {
	1:"基隆市",
	2:"台北市",
	3:"新北市",
	4:"桃園市",
	5:"新竹市",
	6:"新竹縣",
	7:"苗栗縣",
	8:"台中市",
	9:"南投縣",
	10:"彰化縣",
	11:"雲林縣",
	12:"嘉義市",
	13:"嘉義縣",
	14:"台南市",
	15:"高雄市",
	16:"屏東縣",
	17:"宜蘭縣",
	18:"花蓮縣",
	19:"台東縣",
	20:"澎湖縣",
	21:"金門縣",
	22:"馬祖",
}
var tw_qu = {
	1:"七堵區,中山區,中正區,仁愛區,安樂區,信義區,暖暖區",
	2:"士林區,大同區,大安區,中山區,中正區,內湖區,文山區,北投區,松山區,信義區,南港區,萬華區",
	3:"八里區,三芝區,三重區,三峽區,土城區,中和區,五股區,平溪區,永和區,石門區,石碇區,汐止區,坪林區,林口區,板橋區,金山區,泰山區,烏來區,貢寮區,淡水區,深坑區,新店區,新莊區,瑞芳區,萬里區,樹林區,雙溪區,蘆洲區,鶯歌區",
	4:"八德區,大園區,大溪區,中壢區,平鎮區,桃園區,新屋區,楊梅區,龍潭區,龜山區,蘆竹區,觀音區",
	5:"北區,東區,香山區",
	6:"北埔鄉,竹北市,竹東鎮,芎林鄉,湖口鄉,新埔鎮,新豐鄉,橫山鄉,關西鎮,寶山鄉",
	7:"三義鄉,三灣鄉,大湖鄉,公館鄉,竹南鎮,卓蘭鎮,南庄鄉,後龍鎮,苗栗市,苑裡鎮,通霄鎮,造橋鄉,銅鑼鄉,頭份市,頭屋鄉",
	8:"大甲區,大安區,大肚區,大里區,大雅區,中區,太平區,北屯區,北區,外埔區,石岡區,后里區,西屯區,西區,沙鹿區,和平區,東區,東勢區,南屯區,南區,烏日區,神岡區,梧棲區,清水區,新社區,潭子區,龍井區,豐原區,霧峰區",
	9:"仁愛鄉,水里鄉,名間鄉,竹山鎮,信義鄉,南投市,埔里鎮,草屯鎮,國姓鄉,魚池鄉,鹿谷鄉,集集鎮",
	10:"二水鄉,二林鎮,大村鄉,大城鄉,北斗鎮,永靖鄉,田中鎮,田尾鄉,竹塘鄉,伸港鄉,秀水鄉,和美鎮,社頭鄉,芳苑鄉,花壇鄉,芬園鄉,員林市,埔心鄉,埔鹽鄉,埤頭鄉,鹿港鎮,溪州鄉,溪湖鎮,彰化市,福興鄉,線西鄉",
	11:"二崙鄉,口湖鄉,土庫鎮,大埤鄉,元長鄉,斗六市,斗南鎮,水林鄉,北港鎮,古坑鄉,台西鄉,四湖鄉,西螺鎮,東勢鄉,林內鄉,虎尾鎮,崙背鄉,麥寮鄉,莿桐鄉,褒忠鄉",
	12:"西區,東區",
	13:"大林鎮,大埔鄉,中埔鄉,六腳鄉,太保市,水上鄉,布袋鎮,民雄鄉,朴子市,竹崎鄉,東石鄉,阿里山鄉,梅山鄉,鹿草鄉,新港鄉,溪口鄉,義竹鄉",
	14:"七股區,下營區,大內區,山上區,中西區,仁德區,六甲區,北門區,北區,永康區,玉井區,白河區,安平區,安定區,安南區,西港區,佳里區,官田區,東山區,東區,南區,後壁區,柳營區,將軍區,麻豆區,善化區,新化區,新市區,新營區,楠西區,學甲區,歸仁區,關廟區,鹽水區",
	15:"三民區,大社區,大寮區,大樹區,小港區,仁武區,內門區,六龜區,左營區,永安區,甲仙區,杉林區,岡山區,林園區,阿蓮區,前金區,前鎮區,美濃區,茄萣區,苓雅區,梓官區,鳥松區,湖內區,新興區,楠梓區,路竹區,鼓山區,旗山區,旗津區,鳳山區,橋頭區,燕巢區,彌陀區,鹽埕區",
	16:"九如鄉,三地門鄉,內埔鄉,竹田鄉,車城鄉,里港鄉,佳冬鄉,枋山鄉,枋寮鄉,東港鎮,林邊鄉,長治鄉,南州鄉,屏東市,恆春鎮,春日鄉,琉球鄉,高樹鄉,新埤鄉,新園鄉,萬丹鄉,萬巒鄉,滿州鄉,潮州鎮,麟洛鄉,鹽埔鄉",
	17:"三星鄉,五結鄉,冬山鄉,壯圍鄉,宜蘭市,南澳鄉,員山鄉,頭城鎮,礁溪鄉,羅東鎮,蘇澳鎮",
	18:"玉里鎮,光復鄉,吉安鄉,秀林鄉,花蓮市,富里鄉,新城鄉,瑞穗鄉,壽豐鄉,鳳林鎮,豐濱鄉",
	19:"大武鄉,太麻里鄉,台東市,成功鎮,池上鄉,卑南鄉,東河鄉,長濱鄉,鹿野鄉,達仁鄉,綠島鄉,關山鎮,蘭嶼鄉",
	20:"七美鄉,白沙鄉,西嶼鄉,馬公市,湖西鄉",
	21:"金沙鎮,金城鎮,金湖鎮,金寧鄉,烈嶼鄉",
	22:"北竿鄉,東引鄉,南竿鄉",
}
function Getcity(si,qu){
	var si_element = document.getElementById(si);
	var qu_element = document.getElementById(qu);
	var tw_city = "<option value=''>--選擇城市--</option>";

	$.each(tw_si,function(index,item){
		tw_city += "<option name='"+index+"' value='"+item+"'>"+item+"</option>";
	});
	si_element.innerHTML = tw_city;

	si_element.onchange = function(){
		if($(this).val() !== ""){
			var i = $(this).find("option:selected").attr('name');
			var tw_area = tw_qu[i].split(",");
			var area = "<option value=''>--選擇地區--</option>";
			$.each(tw_area,function(i,val){
				area += "<option name='"+i+"' value='"+val+"'>"+val+"</option>";
			});
			qu_element.innerHTML = area;
		}
	};

}


var black_cat = {
    "新北市": {
        "三重區": ["﻿三重一營業所----光華路2之2號", "明志衛星點----大仁街12號", "杭州營業所----光復路一段61巷24弄15號", "北中正營業所----光復路一段61巷24弄15號"],
        "蘆洲區": ["三重二營業所----復興路323巷1號", "蘆洲營業所----水湳街115-2號"],
        "汐止區": ["五堵營業所----大同路三段228號", "汐止營業所----工建路200之2號", "社后營業所----工建路200-1號"],
        "板橋區": ["板運營業所----區運路33號", "板城營業所----干城路158號", "板橋二營業所----大觀路二段417號"],
        "新莊區": ["輔大營業所----建國二路79號", "新莊營業所----建國二路79號", "泰山營業所----新北大道四段342-1號"],
        "八里區": ["八里營業所----賢三街123-2號", "竹圍營業所----頂寮一街6號"],
        "永和區": ["頂溪營業所----信義路103號"],
        "深坑區": ["深坑營業所----北深路三段69號"],
        "林口區": ["林口營業所----文林三街161號"],
        "中和區": ["錦和營業所----員山路36巷8-3號", "中和一營業所----立德街212號", "中和二營業所----員山路36巷8-3號", "板橋一營業所----光中路20號"],
        "五股區": ["大仁營業所----中興路二段83巷26-1號", "五股營業所----中興路二段83巷26-1號"],
        "瑞芳區": ["瑞芳營業所----傑魚坑路311號"],
        "新店區": ["文山營業所----寶中路95-11號", "文山二營業所----寶中路95-11號", "新店營業所----寶中路95號", "永和營業所----中正路501之9號", "安坑營業所----安康路一段89號"],
        "樹林區": ["樹林營業所----大安路1-15號"],
        "三峽區": ["三鶯營業所----三樹路222巷61號"],
        "土城區": ["土城營業所----中央路四段29-1號"],
        "淡水區": ["淡水營業所----北新路一段18號"]
    },
    "台北市": {
        "松山區": ["北航站營業所----敦化北路340-9號(松山機場櫃台)", "中崙營業所----光復北路60巷19-4號"],
        "中山區": ["松江營業所----渭水路52號"],
        "信義區": ["世貿營業所----莊敬路190號之1", "信安營業所----松德路303號", "嘉興營業所----信安街48號"],
        "南港區": ["南港一營業所----重陽路237號"]
    },
    "桃園市": {
        "桃園區": ["桃民營業所----自強路105號", "南桃園營業所----國際路一段708號", "北桃園營業所----富國路216巷78-1號"],
        "平鎮區": ["平鎮營業所----快速路二段1001號"],
        "八德區": ["八德營業所----富榮街149-3號"],
        "中壢區": ["中壢一營業所----水尾里5鄰新生路二段378號", "中壢二營業所----環中東路675號"],
        "蘆竹區": ["蘆竹營業所----南山路二段121-1號"],
        "大園區": ["大園營業所----國際路一段729號"],
        "龜山區": ["龜山營業所----頂湖一街22號"],
        "楊梅區": ["楊梅營業所----幼獅工業區獅一路1-6號"],
        "大溪區": ["大溪營業所----埔頂路一段122號"]
    },
    "新竹市": {
        "北區": ["自由營業所----自由路95巷18弄1號", "新竹營業所----士林里吉羊路100-3號"],
        "東區": ["關東營業所----慈雲路272-1號"],
        "香山區": ["中華營業所----五福路二段708號"]
    },
    "基隆市": {
        "中正區": ["基隆二營業所----中正路62號"]
    },
    "新竹縣": {
        "竹北市": ["竹北營業所----文信路115號", "六家營業所----東興路二段147號"],
        "竹東鎮": ["竹東營業所----沿河街201號"],
        "新豐鄉": ["湖口營業所----建興路一段198-21號"]
    },
    "台中市": {
        "南區": ["中南營業所----南平路2-33號", "興大營業所----仁德街42、48號"],
        "南屯區": ["嶺東營業所----五權西路三段1巷188號", "南台中營業所----永春東路150號"],
        "東勢區": ["東勢營業所----中正路233號"],
        "豐原區": ["后豐營業所----翁子里豐勢路二段477巷6號", "豐原營業所----南陽里保康路131巷7號"],
        "后里區": ["后里營業所----甲后路一段925號"],
        "西屯區": ["逢甲營業所----環中路二段1036巷68號", "瀋陽營業所----中清路三段360號", "中區特販所----工業32路15號", "西屯一營業所----長安路一段65號", "西屯二營業所----工業區三十五路27號"],
        "大甲區": ["大甲營業所----中山路一段1543號"],
        "清水區": ["清水營業所----中清路九段535巷2號"],
        "和平區": ["梨山營業所----梨山村福壽路5號之1"],
        "太平區": ["太平營業所----永成路2-1號"],
        "大里區": ["南峰營業所----大峰路382號", "大里營業所----永隆路455-9號"],
        "龍井區": ["龍井營業所----舊車路1-76號", "榮總營業所----新庄里遊園北路115號"],
        "西區": ["中西營業所----民權路368號", "中市營業所----自由路一段12號"],
        "潭子區": ["潭子營業所----大豐一路52號"],
        "東區": ["中東營業所----二聖街54巷2號"],
        "中區": ["大誠營業所----光復路156、158號"],
        "北屯區": ["北屯營業所----軍功路二段411、411-1號"],
        "大雅區": ["大雅營業所----昌平路四段300號"],
        "烏日區": ["烏日營業所----太明路139號"],
        "沙鹿區": ["沙鹿營業所----台灣大道6段853號"]
    },
    "彰化縣": {
        "彰化市": ["南彰營業所----永芳路262-10號", "彰化營業所----中山路三段209號"],
        "北斗鎮": ["北斗營業所----斗功路286號"],
        "田中鎮": ["田中營業所----復興路42號"],
        "大村鄉": ["大村營業所----南勢村大溪路11-33號"],
        "二林鎮": ["二林營業所----二溪路二段222巷22號 (西安巷10號)"],
        "秀水鄉": ["秀水營業所----彰鹿路288號"],
        "鹿港鎮": ["鹿港營業所----彰濱五路一段372號"],
        "和美鎮": ["和美營業所----彰新路四段751號"],
        "員林市": ["員林營業所----彰化縣員林鎮員集路二段384巷116號"],
        "溪湖鎮": ["溪湖營業所----光平街2號"]
    },
    "南投縣": {
        "草屯鎮": ["草屯營業所----新豐路28號"],
        "埔里鎮": ["中潭營業所----中山路四段422號", "埔里營業所----中正路966號"],
        "水里鄉": ["水里營業所----永豐村堤防路95號"],
        "南投市": ["南投營業所----芳美路25號"],
        "竹山鎮": ["竹山營業所----集山路三段369號"]
    },
    "雲林縣": {
        "斗南鎮": ["斗南營業所----延平路三段75-1號"],
        "麥寮鄉": ["麥寮營業所----中華路158號"],
        "崙背鄉": ["崙背營業所----南昌路666號"],
        "莿桐鄉": ["莿桐營業所----甘厝村甘厝路83-33號"],
        "斗六市": ["斗六營業所----雲林路二段580號"],
        "虎尾鎮": ["虎尾營業所----平和里平和24-30號"],
        "北港鎮": ["北港營業所----民樂路739號"]
    },
    "苗栗縣": {
        "頭份市": ["頭份營業所----苗栗縣頭份鎮大同路283號"],
        "竹南鎮": ["竹南營業所----大埔里10鄰想思林30-7號"],
        "通宵鎮": ["通霄營業所----中山路305號"],
        "苗栗市": ["苗栗營業所----新庄街398號"],
        "大湖鄉": ["大湖營業所----富興村水尾5-3號"]
    },
    "嘉義市": {
        "西區": ["遠東營業所----世賢路一段252號", "嘉義營業所----新民路519巷12號"]
    },
    "嘉義縣": {
        "新港鄉": ["新港營業所----福德路121巷1號"],
        "布袋鎮": ["布袋營業所----江山里10鄰崩山92-1號"],
        "民雄鄉": ["民雄營業所----北斗村15鄰新庄子75號"],
        "竹崎鄉": ["竹崎營業所----和平村坑仔坪161-1號"],
        "中埔鄉": ["中埔營業所----隆興村中正路560號"],
        "六腳鄉": ["朴子營業所----正義村15鄰下雙溪161-2號"]
    },
    "台南市": {
        "善化區": ["善化營業所----小新里小新營198號之1"],
        "白河區": ["白河營業所----裕農路312號"],
        "南區": ["金華營業所----新忠路23號", "安平營業所----新忠路23號"],
        "玉井區": ["玉井營業所----蕉吧年東路239號"],
        "關廟區": ["關廟營業所----南雄路一段946號"],
        "安南區": ["安南營業所----安吉路一段550-2號"],
        "麻豆區": ["麻豆營業所----新生北路101巷3號"],
        "永康區": ["台南營業所----尚頂路68號"],
        "仁德區": ["仁德營業所----文山路266號"],
        "東區": ["南市營業所----崇善三街12號"],
        "新營區": ["新營營業所----復興路1109號"],
        "佳里區": ["佳里營業所----六安里17-25號"],
        "北區": ["府城營業所----文成路655號"]
    },
    "高雄市": {
        "新興區": ["新興營業所----八德一路139號、141號"],
        "岡山區": ["岡山營業所----新樂街112號"],
        "燕巢區": ["燕巢營業所----安招路441號"],
        "鳳山區": ["文德營業所----文正路50號", "鳳山營業所----南華一路82巷2號"],
        "前鎮區": ["苓雅營業所----新強路10號", "高雄營業所----新強路10號", "中高營業所----英義街2號"],
        "美濃區": ["美濃營業所----中山路二段782巷22號"],
        "鼓山區": ["前金營業所----鐵路街11號", "鼓山營業所----葆禎路165、167號"],
        "大寮區": ["林園營業所----潮興路47巷21-1號"],
        "楠梓區": ["仁武營業所----高楠公路939號2F", "北高營業所----高楠公路939號", "左營營業所----高楠公路939號"],
        "旗山區": ["旗山營業所----旗文路156-21號"],
        "三民區": ["三民營業所----大昌一路306號"],
        "小港區": ["小港營業所----山明路307巷226號"],
        "湖內區": ["路竹營業所----湖內里中山路一段77號"]
    },
    "屏東縣": {
        "恆春鎮": ["恆春營業所----草埔路56-1號"],
        "枋寮鄉": ["枋寮營業所----中正大路333號"],
        "鹽埔鄉": ["鹽埔營業所----鹽中村新埔路307號"],
        "內埔鄉": ["內埔營業所----龍泉村中勝路25號"],
        "屏東市": ["屏東營業所----和生路二段546號"],
        "東港鎮": ["東港營業所----船頭里船頭路75-10號"],
        "竹田鄉": ["竹田營業所----竹田村水源路2-16號"],
        "琉球鄉": ["小琉球營業所----中山路28-2號"]
    },
    "宜蘭縣": {
        "頭城鎮": ["頭城營業所----青雲路二段283巷95號"],
        "冬山鄉": ["冬山營業所----永興路一段5號"],
        "五結鄉": ["羅東營業所----中興路二段240號"],
        "宜蘭市": ["宜蘭營業所----中山路五段430號"]
    },
    "花蓮縣": {
        "花蓮市": ["中福營業所----中福路161號"],
        "光復鄉": ["光復營業所----中興路293號"],
        "玉里鎮": ["玉里營業所----民生街44巷2-1號"],
        "吉安鄉": ["花蓮營業所----南海十街142號", "吉安營業所----南海十街142號"],
        "瑞穗鄉": ["瑞穗營業所----中正南路一段63號"]
    },
    "台東縣": {
        "成功鎮": ["成功營業所----芝田路5-3號"],
        "太麻里鄉": ["太麻里營業所----太麻里街95號"],
        "關山鎮": ["關山營業所----新福里順興5-6號"],
        "台東市": ["台東營業所----中山路187號"]
    },
    "金門縣": {
        "金城鎮": ["金門營業所----環島北路96號"]
    },
    "澎湖縣": {
        "馬公市": ["澎湖營業所----西文里10-3號"]
    }
}
function Blackcat(si,qu,area){
	var select_si = document.getElementById(si);
	var select_qu = document.getElementById(qu);
	var select_area = document.getElementById(area);
	var option_si = "<option value=''>--選擇城市--</option>";
	$.each(black_cat,function(i,index){
		option_si += "<option value='"+i+"'>"+i+"</option>";
	});
	select_si.innerHTML = option_si;
	select_si.onchange = function(){
		if($(this).val() !== ""){
			var option_qu = "<option value=''>--選擇地區--</option>";
			$.each(black_cat[$(this).val()],function(i,index){
				option_qu += "<option value='"+i+"'>"+i+"</option>";
			});
			select_qu.innerHTML = option_qu;
		}else{
			select_qu.innerHTML = "<option value=''>--選擇地區--</option>";
			select_area.innerHTML = "<option value=''>--選擇地區--</option>";
		}
	}
	select_qu.onchange = function(){
		if($(this).val() !== ""){
			var option_area = "<option value=''>--選擇地區--</option>";
			$.each(black_cat[$(select_si).find('option:selected').html()][$(this).val()],function(i,index){
				option_area += "<option value='"+index+"'>"+index+"</option>";
			});
			select_area.innerHTML = option_area;
		}else{
			select_area.innerHTML = "<option value=''>--選擇地區--</option>";
		}
	}
}